# Taps
tap "homebrew/cask-fonts"

# Brew
brew "mas"
brew "bat"
brew "clang-format"
brew "fzf"
brew "git-lfs"
brew "glow"
brew "jq"
brew "kotlin"
brew "kotlin-language-server"
brew "npm"
brew "nvim"
brew "prettier"
brew "python3"
brew "ripgrep"
brew "swiftformat"
brew "swiftlint"
brew "swiftplantuml"
brew "zoxide"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tmux"
brew "yarn"

# Casks
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "insomnia"
cask "iterm2"
cask "launchbar"
cash "obsidian"
cask "qlmarkdown"
cask "quicklook-json"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "zoom"
cask "xcodes"


# Mac App Store
mas "Craft - Docs and Notes Editor", id: 1487937127
mas "Screens 4", id: 1224268771
mas "Secrets 4", id: 1591056366

