# Taps
tap "homebrew/cask-fonts"

# Brew
brew "clang-format"
brew "fzf"
brew "git-lfs"
brew "jq"
brew "npm"
brew "nvim"
brew "python3"
brew "ripgrep"
brew "swiftformat"
brew "swiftlint"
brew "zoxide"
brew "romkatv/powerlevel10k/powerlevel10k"

# Casks
cask "brave-browser"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "insomnia"
cask "iterm2"
cask "launchbar"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
case "zoom"


# Mac App Store
mas "Craft", id: 1487937127
mas "Screens 4", id: 1224268771
mas "Secrets", id: 973049011
mas "Xcode", id: 497799835
