# Taps
tap "homebrew/cask-fonts"
tap "FelixKratz/formulae"

# Brew
brew "mas"
brew "bat"
brew "black"
brew "clang-format"
brew "fzf"
brew "git-lfs"
brew "glow"
brew "fd"
brew "jq"
brew "kotlin"
brew "kotlin-language-server"
brew "lazygit"
brew "npm"
brew "nvim"
brew "prettier"
brew "python3"
brew "ripgrep"
brew "swiftformat"
brew "swiftlint"
brew "swiftplantuml"
brew "zoxide"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tldr"
brew "tmux"
brew "yarn"
brew "yazi"
brew "zsh-autosuggestions"

# Casks
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "insomnia"
cask "launchbar"
cash "obsidian"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "sf-symbols"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "wezterm"
cask "zoom"
cask "xcodes"


# Mac App Store
mas "Secrets 4", id: 1591056366

