# Taps
tap "FelixKratz/formulae"

# Brew
brew "mas"
brew "bash"
brew "bat"
brew "black"
brew "btop"
brew "clang-format"
brew "eza"
brew "fzf"
brew "git-delta"
brew "git-lfs"
brew "glow"
brew "fd"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "node"
brew "npm"
brew "nvim"
brew "prettier"
brew "python3"
brew "ripgrep"
brew "swiftformat"
brew "swiftlint"
brew "swiftplantuml"
brew "zoxide"
brew "tree"
brew "tmux"
brew "xcode-build-server"
brew "yarn"
brew "yazi"
brew "zsh-autosuggestions"
brew "zsh-vi-mode"

# Casks
cask "appcleaner"
cask "brave-browser"
cask "discord"
cask "flashspace"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-sf-pro"
cask "ghostty"
cask "insomnia"
cask "launchbar"
cask "obsidian"
cask "qlmarkdown"
cask "quicklook-json"
cask "raycast"
cask "sf-symbols"
cask "swiftformat-for-xcode"
cask "visual-studio-code"
cask "wezterm"
cask "zed"
cask "zen-browser"
cask "zoom"
cask "xcodes"

# Mac App Store
mas "Secrets 4", id: 1591056366

